2nd_CPP_3/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>1年生 C++筆記試験(その３)</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../style1.css" />
</head>
<body>
<div id="content">
<h1 class="title">1年生 C++筆記試験(その３)</h1>

<div id="outline-container-org8c8db9b" class="outline-2">
<h2 id="org8c8db9b">問１</h2>
<div class="outline-text-2" id="text-org8c8db9b">
<p>
以下のソースコード内の①～⑭を埋めよ。<br />
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="linenr"> 1: </span><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">iostream</span><span style="color: #4f97d7;">&gt;</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">using&#23459;&#35328;&#12434;&#29992;&#12356;&#12289;&#12300;std::&#12301;&#12392;&#26360;&#12363;&#12394;&#12367;&#12390;&#28168;&#12416;&#12424;&#12358;&#12395;&#12377;&#12427;</span>
<span class="linenr"> 4: </span><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#8251;using&#12487;&#12451;&#12524;&#12463;&#12486;&#12451;&#12502;&#12399;&#20351;&#29992;&#12375;&#12394;&#12356;&#12371;&#12392;</span>
<span class="linenr"> 5: </span>&#9312;
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#12509;&#12452;&#12531;&#12479;&#22411;&#12398;&#24341;&#25968;&#12434;&#65298;&#12388;&#21463;&#12369;&#12427;</span>
<span class="linenr"> 8: </span>&#9313; <span style="color: #ce537a; font-weight: bold;">void</span> Swap_Ptr<span style="color: #4f97d7;">(</span>&#9314;<span style="color: #4f97d7;">)</span>
<span class="linenr"> 9: </span><span style="color: #4f97d7;">{</span>
<span class="linenr">10: </span>    &#9315;
<span class="linenr">11: </span><span style="color: #4f97d7;">}</span>
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#21442;&#29031;&#22411;&#12398;&#24341;&#25968;&#12434;&#65298;&#12388;&#21463;&#12369;&#12427;</span>
<span class="linenr">14: </span>&#9313; <span style="color: #ce537a; font-weight: bold;">void</span> Swap_Ref<span style="color: #4f97d7;">(</span>&#9316;<span style="color: #4f97d7;">)</span>
<span class="linenr">15: </span><span style="color: #4f97d7;">{</span>
<span class="linenr">16: </span>    &#9317;
<span class="linenr">17: </span><span style="color: #4f97d7;">}</span>
<span class="linenr">18: </span>
<span class="linenr">19: </span><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#21463;&#12369;&#21462;&#12387;&#12383;&#65298;&#12388;&#12398;&#24341;&#25968;&#12398;&#20516;&#12434;&#12289;std::cout&#12434;&#29992;&#12356;&#12390;&#34920;&#31034;&#12377;&#12427;</span>
<span class="linenr">20: </span>&#9313; <span style="color: #ce537a; font-weight: bold;">void</span> Display<span style="color: #4f97d7;">(</span>&#9318;, <span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">pName1</span>, <span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">pName2</span><span style="color: #4f97d7;">)</span>
<span class="linenr">21: </span><span style="color: #4f97d7;">{</span>
<span class="linenr">22: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#12300;&#24341;&#25968;1&#12398;&#21517;&#21069;=&#24341;&#25968;1&#12398;&#20516;&#12289;&#24341;&#25968;2&#12398;&#21517;&#21069;=&#24341;&#25968;2&#12398;&#20516;&lt;&#25913;&#34892;&gt;&#12301;&#12392;&#12356;&#12358;&#24418;&#24335;&#12391;&#34920;&#31034;&#12377;&#12427;&#20966;&#29702;&#12434;&#19968;&#34892;&#12391;&#26360;&#12367;</span>
<span class="linenr">23: </span>    &#9319;
<span class="linenr">24: </span><span style="color: #4f97d7;">}</span>
<span class="linenr">25: </span>
<span class="linenr">26: </span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span>
<span class="linenr">27: </span><span style="color: #4f97d7;">{</span>
<span class="linenr">28: </span>    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a</span> = <span style="color: #a45bad;">5</span>;
<span class="linenr">29: </span>    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">b</span> = <span style="color: #a45bad;">10</span>;
<span class="linenr">30: </span>
<span class="linenr">31: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">a&#12289;b&#12398;&#20516;&#12434;&#34920;&#31034;&#12377;&#12427;</span>
<span class="linenr">32: </span>    &#9320;
<span class="linenr">33: </span>
<span class="linenr">34: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Swap_Ptr()&#12434;&#29992;&#12356;&#12390;a&#12392;b&#12398;&#20516;&#12434;&#20837;&#12428;&#26367;&#12360;&#12427;</span>
<span class="linenr">35: </span>    Swap_Ptr<span style="color: #bc6ec5;">(</span>&#9321;<span style="color: #bc6ec5;">)</span>;
<span class="linenr">36: </span>
<span class="linenr">37: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">a&#12289;b&#12398;&#20516;&#12434;&#34920;&#31034;&#12377;&#12427;</span>
<span class="linenr">38: </span>    &#9320;
<span class="linenr">39: </span>
<span class="linenr">40: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Swap_Ref()&#12434;&#29992;&#12356;&#12390;a&#12392;b&#12398;&#20516;&#12434;&#20837;&#12428;&#26367;&#12360;&#12427;</span>
<span class="linenr">41: </span>    Swap_Ref<span style="color: #bc6ec5;">(</span>&#9322;<span style="color: #bc6ec5;">)</span>;
<span class="linenr">42: </span>
<span class="linenr">43: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">a&#12289;b&#12398;&#20516;&#12434;&#34920;&#31034;&#12377;&#12427;</span>
<span class="linenr">44: </span>    &#9320;
<span class="linenr">45: </span>
<span class="linenr">46: </span>
<span class="linenr">47: </span>    <span style="color: #ce537a; font-weight: bold;">float</span> c = <span style="color: #a45bad;">1.23f</span>;
<span class="linenr">48: </span>    <span style="color: #ce537a; font-weight: bold;">float</span> <span style="color: #7590db;">d</span> = <span style="color: #a45bad;">4.56f</span>;
<span class="linenr">49: </span>
<span class="linenr">50: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">c&#12289;d&#12398;&#20516;&#12434;&#34920;&#31034;&#12377;&#12427;</span>
<span class="linenr">51: </span>    &#9323;
<span class="linenr">52: </span>
<span class="linenr">53: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Swap_Ptr()&#12434;&#29992;&#12356;&#12390;c&#12392;d&#12398;&#20516;&#12434;&#20837;&#12428;&#26367;&#12360;&#12427;</span>
<span class="linenr">54: </span>    Swap_Ptr<span style="color: #bc6ec5;">(</span>&#9324;<span style="color: #bc6ec5;">)</span>;
<span class="linenr">55: </span>
<span class="linenr">56: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">c&#12289;d&#12398;&#20516;&#12434;&#34920;&#31034;&#12377;&#12427;</span>
<span class="linenr">57: </span>    &#9323;
<span class="linenr">58: </span>
<span class="linenr">59: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Swap_Ref()&#12434;&#29992;&#12356;&#12390;c&#12392;d&#12398;&#20516;&#12434;&#20837;&#12428;&#26367;&#12360;&#12427;</span>
<span class="linenr">60: </span>    Swap_Ref<span style="color: #bc6ec5;">(</span>&#9325;<span style="color: #bc6ec5;">)</span>;
<span class="linenr">61: </span>
<span class="linenr">62: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">c&#12289;d&#12398;&#20516;&#12434;&#34920;&#31034;&#12377;&#12427;</span>
<span class="linenr">63: </span>    &#9323;
<span class="linenr">64: </span>
<span class="linenr">65: </span>    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span class="linenr">66: </span><span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orga633811" class="outline-2">
<h2 id="orga633811">問２</h2>
<div class="outline-text-2" id="text-orga633811">
<p>
ポインタと参照の使い分けについて、意見を述べよ。<br />
</p>
</div>
</div>


<div id="outline-container-orge130b7d" class="outline-2">
<h2 id="orge130b7d">問３</h2>
<div class="outline-text-2" id="text-orge130b7d">
<p>
下記のクラスについて、問いに答えよ。<br />
</p>
<div class="org-src-container">
<pre class="src src-c"><span class="linenr"> 1: </span><span style="color: #ce537a; font-weight: bold;">class</span> <span style="color: #7590db;">Character</span>
<span class="linenr"> 2: </span><span style="color: #4f97d7;">{</span>
<span class="linenr"> 3: </span><span style="color: #a45bad;">public</span>:
<span class="linenr"> 4: </span>    virtual <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">Attack</span><span style="color: #bc6ec5;">()</span> = <span style="color: #a45bad;">0</span>;
<span class="linenr"> 5: </span><span style="color: #4f97d7;">}</span>;
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #ce537a; font-weight: bold;">class</span> <span style="color: #7590db;">Enemy</span> : public Character
<span class="linenr"> 8: </span><span style="color: #4f97d7;">{</span>
<span class="linenr"> 9: </span><span style="color: #4f97d7;">}</span>;
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #ce537a; font-weight: bold;">class</span> <span style="color: #7590db;">Queen</span> : public Enemy
<span class="linenr">12: </span><span style="color: #4f97d7;">{</span>
<span class="linenr">13: </span><span style="color: #a45bad;">public</span>:
<span class="linenr">14: </span>    virtual <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">Attack</span><span style="color: #bc6ec5;">()</span> <span style="color: #bc6ec5;">{</span>
<span class="linenr">15: </span>        <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#25915;&#25731;&#12398;&#20966;&#29702;</span>
<span class="linenr">16: </span>    <span style="color: #bc6ec5;">}</span>
<span class="linenr">17: </span><span style="color: #4f97d7;">}</span>;
</pre>
</div>
</div>


<div id="outline-container-org7609df6" class="outline-3">
<h3 id="org7609df6">１．</h3>
<div class="outline-text-3" id="text-org7609df6">
<p>
以下のコードがエラーになる理由を述べよ。<br />
</p>
<div class="org-src-container">
<pre class="src src-c"><span class="linenr">1: </span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span>
<span class="linenr">2: </span><span style="color: #4f97d7;">{</span>
<span class="linenr">3: </span>    <span style="color: #ce537a; font-weight: bold;">Character</span> <span style="color: #7590db;">character</span>;
<span class="linenr">4: </span>
<span class="linenr">5: </span>    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span class="linenr">6: </span><span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1418906" class="outline-3">
<h3 id="org1418906">２．</h3>
<div class="outline-text-3" id="text-org1418906">
<p>
以下のコードがエラーになる理由を述べよ。<br />
</p>
<div class="org-src-container">
<pre class="src src-c"><span class="linenr">1: </span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span>
<span class="linenr">2: </span><span style="color: #4f97d7;">{</span>
<span class="linenr">3: </span>    <span style="color: #ce537a; font-weight: bold;">Enemy</span> <span style="color: #7590db;">enemy</span>;
<span class="linenr">4: </span>
<span class="linenr">5: </span>    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span class="linenr">6: </span><span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org8616459" class="outline-2">
<h2 id="org8616459">問４</h2>
<div class="outline-text-2" id="text-org8616459">
<p>
以下のソースコードの①～⑤を埋めよ<br />
</p>
<div class="org-src-container">
<pre class="src src-c"><span class="linenr"> 1: </span><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">vector</span><span style="color: #4f97d7;">&gt;</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #ce537a; font-weight: bold;">class</span> <span style="color: #7590db;">Sample</span>
<span class="linenr"> 4: </span><span style="color: #4f97d7;">{</span>
<span class="linenr"> 5: </span><span style="color: #a45bad;">public</span>:
<span class="linenr"> 6: </span>    Sample<span style="color: #bc6ec5;">()</span>;
<span class="linenr"> 7: </span>    virtual ~Sample<span style="color: #bc6ec5;">()</span>;
<span class="linenr"> 8: </span><span style="color: #a45bad;">private</span>:
<span class="linenr"> 9: </span>    &#9312; m_pIntArray;
<span class="linenr">10: </span>    &#9313; m_intVector;
<span class="linenr">11: </span><span style="color: #4f97d7;">}</span>;
<span class="linenr">12: </span>
<span class="linenr">13: </span>Sample::Sample<span style="color: #4f97d7;">()</span>
<span class="linenr">14: </span><span style="color: #4f97d7;">{</span>
<span class="linenr">15: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#35201;&#32032;&#25968;10&#12398;int&#22411;&#12398;&#37197;&#21015;&#12434;new&#12375;&#12289;&#20808;&#38957;&#12450;&#12489;&#12524;&#12473;&#12434;m_pIntArray&#12395;&#20195;&#20837;</span>
<span class="linenr">16: </span>    &#9314;
<span class="linenr">17: </span>
<span class="linenr">18: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">for&#25991;&#12434;&#29992;&#12356;&#12289;0&#65374;18&#12398;&#20598;&#25968;&#12434;m_intVector&#12395;&#35440;&#12417;&#12427;</span>
<span class="linenr">19: </span>    &#9315;
<span class="linenr">20: </span><span style="color: #4f97d7;">}</span>
<span class="linenr">21: </span>
<span class="linenr">22: </span>Sample::~Sample<span style="color: #4f97d7;">()</span>
<span class="linenr">23: </span><span style="color: #4f97d7;">{</span>
<span class="linenr">24: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#24517;&#35201;&#12394;&#20966;&#29702;&#12364;&#12354;&#12428;&#12400;&#12371;&#12371;&#12395;&#35352;&#36848;</span>
<span class="linenr">25: </span>    &#9316;
<span class="linenr">26: </span><span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
